martin-ger/esp32_nat_router/main/esp32_nat_router.c
/* ESP32 WiFi Repeater - Main application
 *
 * Entry point, global variable definitions, WiFi initialization,
 * event handlers, LED status thread, and console REPL.
 *
 * Modular source files:
 *   portmap.c       - Port mapping (NAPT) table management
 *   dhcp_manager.c  - DHCP reservation management
 *   acl_nvs.c       - ACL firewall rule persistence
 *   netif_hooks.c   - Network interface hooks (byte counting, ACL, PCAP, MSS/PMTU)
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <inttypes.h>
#include <time.h>
#include <pthread.h>
#include "esp_system.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_console.h"
#include "esp_vfs_dev.h"
#include "driver/gpio.h"
#include "driver/uart.h"
#include "driver/uart_vfs.h"
#include "driver/usb_serial_jtag.h"
#include "driver/usb_serial_jtag_vfs.h"
#include "linenoise/linenoise.h"
#include "argtable3/argtable3.h"
#include "esp_vfs_fat.h"
#include "nvs.h"
#include "nvs_flash.h"
#include "esp_ota_ops.h"

#include "freertos/event_groups.h"
#include "esp_wifi.h"
#include "esp_eap_client.h"

#include "lwip/opt.h"
#include "lwip/err.h"
#include "lwip/sys.h"
#include "esp_sntp.h"

#include "dhcpserver/dhcpserver.h"
#include "dhcpserver/dhcpserver_options.h"

#include "cmd_system.h"
#include "cmd_router.h"
#include <esp_http_server.h>

#if !IP_NAPT
#error "IP_NAPT must be defined"
#endif
#include "lwip/lwip_napt.h"

#include "router_globals.h"
#include "lwip/ip_addr.h"
#include "esp_netif.h"
#include "client_stats.h"
#include "pcap_capture.h"
#include "remote_console.h"
#include "syslog_client.h"
#include "oled_display.h"
#include "led_strip_status.h"
#include "mdns.h"
#if CONFIG_MQTT_HOMEASSISTANT
#include "mqtt_ha.h"
#if CONFIG_REPEATER_MODE
#include "repeater_forward.h"
#include "cmd_repeater.h"
#endif
#endif

// Byte counting variables
uint64_t sta_bytes_sent = 0;
uint64_t sta_bytes_received = 0;

// TTL override for STA upstream (0 = disabled/no change)
uint8_t sta_ttl_override = 0;

// Reconnect watchdog timeout in seconds (0 = disabled)
uint16_t reconnect_watchdog_s = 0;

// MSS clamp for AP interface (0 = disabled, otherwise max MSS in bytes)
uint16_t ap_mss_clamp = 0;

// Path MTU for AP clients: send ICMP Fragmentation Needed when a DF-flagged packet
// from a client exceeds this size (0 = disabled).
uint16_t ap_pmtu = 0;

// AP SSID hidden (0 = visible, 1 = hidden)
uint8_t ap_ssid_hidden = 0;

// WiFi regulatory country code ("01" = world-safe default)
char wifi_country_code[3] = "01";

// AP auth mode (0 = WPA2/WPA3, 1 = WPA2 only, 2 = WPA3 only)
uint8_t ap_authmode = 0;

// WPA2-Enterprise settings
int32_t eap_method = 0;          // 0=Auto, 1=PEAP, 2=TTLS, 3=TLS
int32_t ttls_phase2 = 0;         // 0=MSCHAPv2, 1=MSCHAP, 2=PAP, 3=CHAP
int32_t use_cert_bundle = 0;     // 0=off, 1=on
int32_t disable_time_check = 0;  // 0=off, 1=on

#if WIFI_HAS_5GHZ
// STA band preference (0=auto, 1=2.4GHz, 2=5GHz)
uint8_t sta_band = STA_BAND_AUTO;
#endif

/* FreeRTOS event group to signal when we are connected*/
static EventGroupHandle_t wifi_event_group;

/* The event group allows multiple bits for each event, but we only care about one event
 * - are we connected to the AP with an IP? */
const int WIFI_CONNECTED_BIT = BIT0;

#define DEFAULT_DNS "8.8.8.8"

/* STA reconnect backoff */
#define STA_RECONNECT_INITIAL_MS  250
#define STA_RECONNECT_MAX_MS     16000
static esp_timer_handle_t sta_reconnect_timer;
static uint32_t sta_reconnect_delay_ms = STA_RECONNECT_INITIAL_MS;

/* Global vars */
uint16_t connect_count = 0;
bool ap_connect = false;
bool wifi_scan_active = false;
bool has_static_ip = false;
int led_gpio = -1;  // -1 means LED disabled (none)
uint8_t led_lowactive = 0;  // 0 = active-high (default), 1 = active-low (inverted)
uint8_t led_toggle = 0;  // Shared toggle state for packet-driven LED flicker

int antenna_gpio = -1;      // -1 means antenna switching disabled (pins untouched)
int antenna_en_gpio = -1;   // Optional RF-switch enable pin, driven low
uint8_t antenna_state = 0;  // 0 = on-board antenna, 1 = external antenna

uint32_t my_ip;
uint32_t my_ap_ip;

struct dhcp_reservation_entry dhcp_reservations[MAX_DHCP_RESERVATIONS];

esp_netif_t* wifiAP;
bool ap_disabled = false;
uint8_t ap_nat_enabled = 1;
esp_netif_t* wifiSTA;

#include "http_server.h"

static const char *TAG = "ESP32 WiFi Repeater";

/* Console command history can be stored to and loaded from a file.
 * The easiest way to do this is to use FATFS filesystem on top of
 * wear_levelling library.
 */
#if CONFIG_STORE_HISTORY

#define MOUNT_PATH "/data"
#define HISTORY_PATH MOUNT_PATH "/history.txt"

static void initialize_filesystem(void)
{
    static wl_handle_t wl_handle;
    const esp_vfs_fat_mount_config_t mount_config = {
            .max_files = 4,
            .format_if_mount_failed = true
    };
    esp_err_t err = esp_vfs_fat_spiflash_mount_rw_wl(MOUNT_PATH, "storage", &mount_config, &wl_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to mount FATFS (%s)", esp_err_to_name(err));
        return;
    }
}
#endif // CONFIG_STORE_HISTORY

static void initialize_nvs(void)
{
    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK( nvs_flash_erase() );
        err = nvs_flash_init();
    }
    ESP_ERROR_CHECK(err);
}

static void initialize_console(void)
{
    /* Disable buffering on stdin */
    setvbuf(stdin, NULL, _IONBF, 0);

#if CONFIG_ESP_CONSOLE_UART_DEFAULT || CONFIG_ESP_CONSOLE_UART_CUSTOM
    /* Drain stdout before reconfiguring it */
    fflush(stdout);
    fsync(fileno(stdout));

    /* Minicom, screen, idf_monitor send CR when ENTER key is pressed */
    uart_vfs_dev_port_set_rx_line_endings(0, ESP_LINE_ENDINGS_CR);
    /* Move the caret to the beginning of the next line on '\n' */
    uart_vfs_dev_port_set_tx_line_endings(0, ESP_LINE_ENDINGS_CRLF);

    /* Configure UART. Note that REF_TICK is used so that the baud rate remains
     * correct while APB frequency is changing in light sleep mode.
     */
    const uart_config_t uart_config = {
            .baud_rate = CONFIG_ESP_CONSOLE_UART_BAUDRATE,
            .data_bits = UART_DATA_8_BITS,
            .parity = UART_PARITY_DISABLE,
            .stop_bits = UART_STOP_BITS_1,
            .source_clk = UART_SCLK_DEFAULT,
    };
    /* Install UART driver for interrupt-driven reads and writes */
    ESP_ERROR_CHECK( uart_driver_install(CONFIG_ESP_CONSOLE_UART_NUM,
            256, 0, 0, NULL, 0) );
    ESP_ERROR_CHECK( uart_param_config(CONFIG_ESP_CONSOLE_UART_NUM, &uart_config) );

    /* Tell VFS to use UART driver */
    uart_vfs_dev_use_driver(CONFIG_ESP_CONSOLE_UART_NUM);
#endif

#if CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG
    /* Enable non-blocking mode on stdin and stdout */
    fcntl(fileno(stdout), F_SETFL, O_NONBLOCK);
    fcntl(fileno(stdin), F_SETFL, O_NONBLOCK);

