martin-ger/esp32_nat_router/main/esp32_nat_router.c
    /* Minicom, screen, idf_monitor send CR when ENTER key is pressed */
    usb_serial_jtag_vfs_set_rx_line_endings(ESP_LINE_ENDINGS_CR);

    /* Move the caret to the beginning of the next line on '\n' */
    usb_serial_jtag_vfs_set_tx_line_endings(ESP_LINE_ENDINGS_CRLF);
    usb_serial_jtag_driver_config_t usb_serial_jtag_config = {
        .tx_buffer_size = 256,
        .rx_buffer_size = 256,
    };

    /* Install USB-SERIAL-JTAG driver for interrupt-driven reads and writes */
    usb_serial_jtag_driver_install(&usb_serial_jtag_config);

    /* Tell vfs to use usb-serial-jtag driver */
    usb_serial_jtag_vfs_use_driver();
#endif

    /* Initialize the console */
    esp_console_config_t console_config = {
            .max_cmdline_args = 12,
            .max_cmdline_length = 256,
#if CONFIG_LOG_COLORS
            .hint_color = atoi(LOG_COLOR_CYAN)
#endif
    };
    ESP_ERROR_CHECK( esp_console_init(&console_config) );

    /* Configure linenoise line completion library */
    /* Enable multiline editing. If not set, long commands will scroll within
     * single line.
     */
    linenoiseSetMultiLine(1);

    /* Tell linenoise where to get command completions and hints */
    linenoiseSetCompletionCallback(&esp_console_get_completion);
    linenoiseSetHintsCallback((linenoiseHintsCallback*) &esp_console_get_hint);

    /* Set command history size */
    linenoiseHistorySetMaxLen(100);

#if CONFIG_STORE_HISTORY
    /* Load command history from filesystem */
    linenoiseHistoryLoad(HISTORY_PATH);
#endif
}

// BOOT button GPIO: GPIO28 on ESP32-C5 board, GPIO9 on C3/C2/C6, GPIO0 on ESP32/S2/S3
#if defined(CONFIG_IDF_TARGET_ESP32C5)
#define BOOT_BUTTON_GPIO      28
#elif defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C2) || defined(CONFIG_IDF_TARGET_ESP32C6)
#define BOOT_BUTTON_GPIO      9
#else
#define BOOT_BUTTON_GPIO      0
#endif
#define FACTORY_RESET_HOLD_MS 5000
#define POLL_INTERVAL_MS      50

void * led_status_thread(void * p)
{
    // Init boot button for factory reset detection
    gpio_reset_pin(BOOT_BUTTON_GPIO);
    gpio_set_direction(BOOT_BUTTON_GPIO, GPIO_MODE_INPUT);
    gpio_set_pull_mode(BOOT_BUTTON_GPIO, GPIO_PULLUP_ONLY);

    bool led_enabled = (led_gpio >= 0);
    if (led_enabled) {
        ESP_LOGI(TAG, "LED status on GPIO %d%s", led_gpio, led_lowactive ? " (low-active)" : "");
        gpio_reset_pin(led_gpio);
        gpio_set_direction(led_gpio, GPIO_MODE_OUTPUT);
    } else {
        ESP_LOGI(TAG, "LED status disabled (no GPIO configured)");
    }

    int held_ms = 0;
    uint32_t wd_disconnected_s = 0;

    bool strip_active = led_strip_is_active();

    while (true)
    {
        // --- LED status: OFF=disconnected, ON=connected (packet hooks flicker it off) ---
        if (led_enabled && held_ms == 0) {
            gpio_set_level(led_gpio, ap_connect ^ led_lowactive);
        }

        // --- Poll interval with button polling ---
        for (int t = 0; t < 1000 / POLL_INTERVAL_MS; t++) {
            vTaskDelay(pdMS_TO_TICKS(POLL_INTERVAL_MS));

            // Update addressable LED strip colour each tick
            if (strip_active) {
                led_strip_status_update();
            }

            if (gpio_get_level(BOOT_BUTTON_GPIO) == 0) {
                held_ms += POLL_INTERVAL_MS;
                // Rapid LED toggle for visual feedback during hold
                if (led_enabled) {
                    gpio_set_level(led_gpio, ((held_ms / POLL_INTERVAL_MS) % 2) ^ led_lowactive);
                }
                if (strip_active) {
                    led_strip_set_factory_reset(true);
                }
                if (held_ms >= FACTORY_RESET_HOLD_MS) {
                    ESP_LOGW(TAG, "BOOT button held %d ms - factory reset!", held_ms);
                    nvs_handle_t nvs;
                    if (nvs_open(PARAM_NAMESPACE, NVS_READWRITE, &nvs) == ESP_OK) {
                        nvs_erase_all(nvs);
                        nvs_commit(nvs);
                        nvs_close(nvs);
                    }
                    esp_wifi_restore();
                    esp_restart();
                }
            } else {
                if (held_ms > 0 && strip_active) {
                    led_strip_set_factory_reset(false);
                }
                held_ms = 0;
            }
        }

        /* Reconnect watchdog: restart if uplink has been down too long */
        if (reconnect_watchdog_s > 0 && ssid != NULL && ssid[0] != '\0') {
            if (ap_connect) {
                wd_disconnected_s = 0;
            } else if (++wd_disconnected_s >= reconnect_watchdog_s) {
                ESP_LOGW(TAG, "Watchdog: no uplink for %"PRIu32" s, restarting", wd_disconnected_s);
                esp_restart();
            }
        }
    }
}

/* Event handlers */

#if WIFI_HAS_5GHZ
/**
 * Band-aware STA connection helper.
 *
 * When a band preference is configured (sta_band == STA_BAND_2G or STA_BAND_5G),
 * this function scans for the configured SSID, selects the best BSSID on the
 * preferred band, and sets it in the STA config before connecting.
 * Falls back to the other band if the preferred one is unavailable.
 *
 * When sta_band == STA_BAND_AUTO (or on non-5GHz chips) this just calls
 * esp_wifi_connect() directly.
 */
static void wifi_connect_band_aware(void)
{
    if (sta_band == STA_BAND_AUTO || ssid == NULL || ssid[0] == '\0') {
        esp_wifi_connect();
        return;
    }

    /* Targeted scan for our SSID only */
    wifi_scan_config_t scan_cfg = {
        .ssid = (uint8_t *)ssid,
        .bssid = NULL,
        .channel = 0,
        .show_hidden = true,
        .scan_type = WIFI_SCAN_TYPE_ACTIVE,
    };

    esp_err_t err = esp_wifi_scan_start(&scan_cfg, true);  /* blocking */
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Band-aware scan failed (%s), falling back", esp_err_to_name(err));
        esp_wifi_connect();
        return;
    }

    uint16_t ap_count = 0;
    esp_wifi_scan_get_ap_num(&ap_count);
    if (ap_count == 0) {
        ESP_LOGI(TAG, "No APs found for SSID '%s', connecting normally", ssid);
        esp_wifi_connect();
        return;
    }

    wifi_ap_record_t *ap_list = malloc(sizeof(wifi_ap_record_t) * ap_count);
    if (ap_list == NULL) {
        esp_wifi_connect();
        return;
    }
    esp_wifi_scan_get_ap_records(&ap_count, ap_list);

    /* Find best BSSID on preferred band, and best on any band as fallback */
    int best_preferred = -1;
    int best_fallback = -1;
    for (int i = 0; i < ap_count; i++) {
        bool is_5g = (ap_list[i].primary > 14);
        bool matches_pref = (sta_band == STA_BAND_5G) ? is_5g : !is_5g;

