martin-ger/esp32_nat_router/main/esp32_nat_router.c
        if (matches_pref) {
            if (best_preferred < 0 || ap_list[i].rssi > ap_list[best_preferred].rssi)
                best_preferred = i;
        } else {
            if (best_fallback < 0 || ap_list[i].rssi > ap_list[best_fallback].rssi)
                best_fallback = i;
        }
    }

    int chosen = (best_preferred >= 0) ? best_preferred : best_fallback;
    if (chosen < 0) {
        free(ap_list);
        esp_wifi_connect();
        return;
    }

    if (best_preferred < 0) {
        ESP_LOGW(TAG, "Preferred band (%s) unavailable, falling back to %s",
                 (sta_band == STA_BAND_5G) ? "5 GHz" : "2.4 GHz",
                 (sta_band == STA_BAND_5G) ? "2.4 GHz" : "5 GHz");
    }

    ESP_LOGI(TAG, "Connecting to BSSID %02X:%02X:%02X:%02X:%02X:%02X (ch %d, %s, %d dBm)",
             ap_list[chosen].bssid[0], ap_list[chosen].bssid[1],
             ap_list[chosen].bssid[2], ap_list[chosen].bssid[3],
             ap_list[chosen].bssid[4], ap_list[chosen].bssid[5],
             ap_list[chosen].primary,
             ap_list[chosen].primary > 14 ? "5 GHz" : "2.4 GHz",
             ap_list[chosen].rssi);

    /* Update STA config with the chosen BSSID */
    wifi_config_t sta_cfg;
    esp_wifi_get_config(WIFI_IF_STA, &sta_cfg);
    memcpy(sta_cfg.sta.bssid, ap_list[chosen].bssid, 6);
    sta_cfg.sta.bssid_set = true;
    sta_cfg.sta.channel = ap_list[chosen].primary;
    esp_wifi_set_config(WIFI_IF_STA, &sta_cfg);

    free(ap_list);
    esp_wifi_connect();
}
#endif /* WIFI_HAS_5GHZ */

static inline void sta_connect(void)
{
#if WIFI_HAS_5GHZ
    wifi_connect_band_aware();
#else
    esp_wifi_connect();
#endif
}

static void sta_reconnect_timer_cb(void* arg)
{
    ESP_LOGI(TAG, "reconnect backoff expired (%"PRIu32" ms), attempting STA connect", sta_reconnect_delay_ms);
    sta_connect();
    /* Double the delay for next time, capped at max */
    if (sta_reconnect_delay_ms < STA_RECONNECT_MAX_MS) {
        sta_reconnect_delay_ms *= 2;
        if (sta_reconnect_delay_ms > STA_RECONNECT_MAX_MS) {
            sta_reconnect_delay_ms = STA_RECONNECT_MAX_MS;
        }
    }
}

static void sta_schedule_reconnect(void)
{
    /* Stop any pending reconnect timer before starting a new one */
    esp_timer_stop(sta_reconnect_timer);
    ESP_LOGI(TAG, "scheduling STA reconnect in %"PRIu32" ms", sta_reconnect_delay_ms);
    esp_timer_start_once(sta_reconnect_timer, (uint64_t)sta_reconnect_delay_ms * 1000);
}

static void init_sntp_if_needed(void)
{
    if (esp_sntp_enabled()) return;
    ESP_LOGI(TAG, "Initializing SNTP");
    esp_sntp_setoperatingmode(ESP_SNTP_OPMODE_POLL);
    esp_sntp_setservername(0, "pool.ntp.org");
    esp_sntp_setservername(1, "time.nist.gov");
    esp_sntp_setservername(2, "time.google.com");
    esp_sntp_init();
}

static void wifi_event_handler(void* arg, esp_event_base_t event_base,
                                int32_t event_id, void* event_data)
{
    esp_netif_dns_info_t dns;

    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START)
    {
        sta_connect();
    }
    else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED)
    {
        wifi_event_sta_disconnected_t* d = (wifi_event_sta_disconnected_t*) event_data;
        ESP_LOGI(TAG,"disconnected (reason %d) - retry to connect to the AP", d->reason);
        ap_connect = false;
        if (wifi_scan_active) {
            ESP_LOGI(TAG, "scan in progress - deferring reconnect");
        } else {
            sta_schedule_reconnect();
        }
        xEventGroupClearBits(wifi_event_group, WIFI_CONNECTED_BIT);
    }
    else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_SCAN_DONE)
    {
        if (wifi_scan_active) {
            /* Just clear the flag — don't reconnect here.
             * Reconnection is handled by the caller (CLI after reading results,
             * or the disconnect handler once wifi_scan_active is cleared). */
            wifi_scan_active = false;
            ESP_LOGI(TAG, "scan complete");
        }
    }
    else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP)
    {
        ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
        ESP_LOGI(TAG, "got ip:" IPSTR, IP2STR(&event->ip_info.ip));
        /* Reset backoff on successful connection */
        sta_reconnect_delay_ms = STA_RECONNECT_INITIAL_MS;
        esp_timer_stop(sta_reconnect_timer);
        ap_connect = true;
        my_ip = event->ip_info.ip.addr;
        if (!(ap_dns && ap_dns[0])) {
            if (esp_netif_get_dns_info(wifiSTA, ESP_NETIF_DNS_MAIN, &dns) == ESP_OK)
            {
                esp_netif_set_dns_info(wifiAP, ESP_NETIF_DNS_MAIN, &dns);
                ESP_LOGI(TAG, "set dns to:" IPSTR, IP2STR(&(dns.ip.u_addr.ip4)));
            }
        } else {
            /* Override DHCP-assigned DNS on wifiSTA so the router's own
             * resolver (SNTP, VPN endpoint, syslog) uses the configured DNS. */
            dns.ip.u_addr.ip4.addr = esp_ip4addr_aton(ap_dns);
            dns.ip.type = ESP_IPADDR_TYPE_V4;
            esp_netif_set_dns_info(wifiSTA, ESP_NETIF_DNS_MAIN, &dns);
            ESP_LOGI(TAG, "override sta dns with configured: %s", ap_dns);
        }

        // Initialize byte counter after getting IP (interface is ready)
        init_byte_counter();

#if CONFIG_REPEATER_MODE
        /* Pin the AP to the STA's current channel. With APSTA the driver
         * usually aligns them, but make it explicit so the bridge can never
         * end up with the two interfaces on different channels. */
        {
            uint8_t prim = 0;
            wifi_second_chan_t sec = WIFI_SECOND_CHAN_NONE;
            if (esp_wifi_get_channel(&prim, &sec) == ESP_OK && prim != 0) {
                esp_wifi_set_channel(prim, sec);
            }
        }
#endif

        // Start SNTP time synchronization
        init_sntp_if_needed();

        // Re-resolve syslog server now that network is up
        syslog_notify_connected();

#if !CONFIG_REPEATER_MODE
        /* Re-enable NAPT here in case the AP cycled (channel change from
         * band-aware scan) after the initial ip_napt_enable in app_main. */
        if (ap_nat_enabled)
            ip_napt_enable(my_ap_ip, 1);
#endif

        xEventGroupSetBits(wifi_event_group, WIFI_CONNECTED_BIT);
    }
    else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_START)
    {
        ESP_LOGI(TAG, "AP started");
        // Initialize AP netif hooks now that interface is ready
        init_ap_netif_hooks();
#if !CONFIG_REPEATER_MODE
        /* Re-enable NAPT on every AP start: covers the initial start and any
         * restart caused by the band-aware scan forcing a channel change. */
        if (ap_nat_enabled && my_ap_ip != 0)
            ip_napt_enable(my_ap_ip, 1);
#endif
    }
    else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_STACONNECTED)
    {
        wifi_event_ap_staconnected_t* event = (wifi_event_ap_staconnected_t*) event_data;

        /* Check if this MAC is blacklisted (reservation with IP 0.0.0.0) */
        if (is_mac_blocked(event->mac)) {
            const char* name = lookup_device_name_by_mac(event->mac);
            ESP_LOGW(TAG, "Blocked client: %02X:%02X:%02X:%02X:%02X:%02X%s%s",
                     event->mac[0], event->mac[1], event->mac[2],
                     event->mac[3], event->mac[4], event->mac[5],
                     name ? " (" : "", name ? name : "");
            esp_wifi_deauth_sta(event->aid);
            return;
        }

