martin-ger/esp32_nat_router/main/esp32_nat_router.c
    if (strlen(ssid) > 0) {
        //Set SSID
        strlcpy((char*)wifi_config.sta.ssid, ssid, sizeof(wifi_config.sta.ssid));
        //Set password
        if(strlen(ent_username) == 0) {
            ESP_LOGI(TAG, "STA regular connection");
            strlcpy((char*)wifi_config.sta.password, passwd, sizeof(wifi_config.sta.password));
        }
        ESP_ERROR_CHECK(esp_wifi_set_config(ESP_IF_WIFI_STA, &wifi_config) );
        if(strlen(ent_username) != 0) {
            ESP_LOGI(TAG, "STA enterprise connection");
            if(strlen(ent_identity) != 0) {
                esp_eap_client_set_identity((uint8_t *)ent_identity, strlen(ent_identity));
            } else {
                esp_eap_client_set_identity((uint8_t *)ent_username, strlen(ent_username));
            }
            esp_eap_client_set_username((uint8_t *)ent_username, strlen(ent_username));
            esp_eap_client_set_password((uint8_t *)passwd, strlen(passwd));

            // Set TTLS phase 2 method
            if (ttls_phase2 >= 0 && ttls_phase2 <= 3) {
                esp_eap_client_set_ttls_phase2_method(ttls_phase2);
            }

            // Use CA certificate bundle for server validation
#ifdef CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
            if (use_cert_bundle) {
                esp_eap_client_use_default_cert_bundle(true);
            }
#endif

            // Disable certificate time check
            if (disable_time_check) {
                esp_eap_client_set_disable_time_check(true);
            }

            esp_wifi_sta_enterprise_enable();
        }

        if (mac != NULL) {
            ESP_ERROR_CHECK(esp_wifi_set_mac(ESP_IF_WIFI_STA, mac));
        }
    }

    if (!ap_disabled) {
        ESP_ERROR_CHECK(esp_wifi_set_config(ESP_IF_WIFI_AP, &ap_config));
        if (ap_mac != NULL) {
            ESP_ERROR_CHECK(esp_wifi_set_mac(ESP_IF_WIFI_AP, ap_mac));
        }
    }


#if !CONFIG_REPEATER_MODE
    // Enable DNS (offer) for dhcp server
    dhcps_offer_t dhcps_dns_value = OFFER_DNS;
    esp_netif_dhcps_option(wifiAP, ESP_NETIF_OP_SET, ESP_NETIF_DOMAIN_NAME_SERVER, &dhcps_dns_value, sizeof(dhcps_dns_value));

    // Set DNS server address for DHCP clients.
    // When no STA is configured, point clients at the AP itself so the
    // captive-portal DNS server can intercept all queries.
    if (strlen(ssid) > 0) {
        const char *dns_src = (ap_dns && ap_dns[0]) ? ap_dns : "1.1.1.1";
        dnsserver.ip.u_addr.ip4.addr = esp_ip4addr_aton(dns_src);
    } else {
        dnsserver.ip.u_addr.ip4.addr = my_ap_ip;
    }
    dnsserver.ip.type = ESP_IPADDR_TYPE_V4;
    esp_netif_set_dns_info(wifiAP, ESP_NETIF_DNS_MAIN, &dnsserver);
#else
    if (strlen(ssid) == 0) {
        // Unconfigured repeater: enable DNS offer and point clients at AP for captive portal
        dhcps_offer_t dhcps_dns_value = OFFER_DNS;
        esp_netif_dhcps_option(wifiAP, ESP_NETIF_OP_SET, ESP_NETIF_DOMAIN_NAME_SERVER, &dhcps_dns_value, sizeof(dhcps_dns_value));
        dnsserver.ip.u_addr.ip4.addr = my_ap_ip;
        dnsserver.ip.type = ESP_IPADDR_TYPE_V4;
        esp_netif_set_dns_info(wifiAP, ESP_NETIF_DNS_MAIN, &dnsserver);
    } else {
        (void)dnsserver;
    }
#endif

    if (has_static_ip && ap_dns && ap_dns[0]) {
        esp_netif_dns_info_t sta_dns;
        sta_dns.ip.u_addr.ip4.addr = esp_ip4addr_aton(ap_dns);
        sta_dns.ip.type = ESP_IPADDR_TYPE_V4;
        esp_netif_set_dns_info(wifiSTA, ESP_NETIF_DNS_MAIN, &sta_dns);
    }

    // esp_netif_get_dns_info(ESP_IF_WIFI_AP, ESP_NETIF_DNS_MAIN, &dnsinfo);
    // ESP_LOGI(TAG, "DNS IP:" IPSTR, IP2STR(&dnsinfo.ip.u_addr.ip4));

    ESP_ERROR_CHECK(esp_wifi_start());

#if CONFIG_REPEATER_MODE
    /* In bridge mode the AP must always be on-channel and continuously
     * available. Disable WiFi modem sleep so the radio stays awake while
     * the bridge forwards frames between STA and AP. */
    esp_wifi_set_ps(WIFI_PS_NONE);
#endif

    if (strlen(ssid) > 0) {
        ESP_LOGI(TAG, "wifi_init_apsta finished.");
        ESP_LOGI(TAG, "connect to ap SSID: %s ", ssid);
    } else {
        ESP_LOGI(TAG, "wifi_init_ap with default finished.");
    }
}

uint8_t* mac = NULL;
char* ssid = NULL;
char* ent_username = NULL;
char* ent_identity = NULL;
char* passwd = NULL;
char* static_ip = NULL;
char* subnet_mask = NULL;
char* gateway_addr = NULL;
uint8_t* ap_mac = NULL;
char* ap_ssid = NULL;
char* ap_passwd = NULL;
char* ap_ip = NULL;
char* ap_dns = NULL;
char* hostname = NULL;

char* param_set_default(const char* def_val) {
    char * retval = malloc(strlen(def_val)+1);
    if (retval == NULL) {
        ESP_LOGE(TAG, "Failed to allocate memory for default parameter");
        return NULL;
    }
    strcpy(retval, def_val);
    return retval;
}

/* Antenna (RF) switch control.
 *
 * Boards with both an on-board and an external antenna route the RF path
 * through a switch that is driven by a GPIO: the Waveshare ESP32-C5-Zero uses
 * GPIO 26 (low = on-board, high = external IPEX-1), the XIAO ESP32-C6 uses
 * GPIO 14 for the selection plus GPIO 3 to enable the switch.  Both pin
 * numbers are configuration, not compile-time constants, so any board with
 * such a switch can be driven from the console or the web UI. */
esp_err_t antenna_switch_apply(void)
{
    if (antenna_gpio < 0) {
        return ESP_OK;
    }
    if (!GPIO_IS_VALID_OUTPUT_GPIO(antenna_gpio)) {
        ESP_LOGE(TAG, "Antenna switch: GPIO%d is not usable as output", antenna_gpio);
        return ESP_ERR_INVALID_ARG;
    }

    if (antenna_en_gpio >= 0) {
        if (!GPIO_IS_VALID_OUTPUT_GPIO(antenna_en_gpio)) {
            ESP_LOGE(TAG, "Antenna switch: enable GPIO%d is not usable as output",
                     antenna_en_gpio);
            return ESP_ERR_INVALID_ARG;
        }
        gpio_reset_pin((gpio_num_t)antenna_en_gpio);
        gpio_set_direction((gpio_num_t)antenna_en_gpio, GPIO_MODE_OUTPUT);
        gpio_set_level((gpio_num_t)antenna_en_gpio, 0);  // Active-low: power the RF switch
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    gpio_reset_pin((gpio_num_t)antenna_gpio);
    gpio_set_direction((gpio_num_t)antenna_gpio, GPIO_MODE_OUTPUT);
    gpio_set_level((gpio_num_t)antenna_gpio, antenna_state);

