martin-ger/esp32_nat_router/main/esp32_nat_router.c
    ESP_LOGI(TAG, "Antenna switch: GPIO%d = %d (%s antenna)",
             antenna_gpio, antenna_state,
             antenna_state ? "external" : "on-board");
    return ESP_OK;
}

esp_err_t antenna_switch_set(int gpio, int state, int en_gpio)
{
    if (gpio >= 0 && !GPIO_IS_VALID_OUTPUT_GPIO(gpio)) {
        return ESP_ERR_INVALID_ARG;
    }
    if (gpio >= 0 && en_gpio >= 0 && !GPIO_IS_VALID_OUTPUT_GPIO(en_gpio)) {
        return ESP_ERR_INVALID_ARG;
    }
    if (gpio >= 0 && gpio == en_gpio) {
        return ESP_ERR_INVALID_ARG;
    }

    if (gpio < 0) {
        gpio = -1;
        en_gpio = -1;
    }
    if (en_gpio < 0) {
        en_gpio = -1;
    }

    /* Hand any pin we were driving but no longer use back to its default state */
    if (antenna_gpio >= 0 && antenna_gpio != gpio && antenna_gpio != en_gpio) {
        gpio_reset_pin((gpio_num_t)antenna_gpio);
    }
    if (antenna_en_gpio >= 0 && antenna_en_gpio != gpio && antenna_en_gpio != en_gpio) {
        gpio_reset_pin((gpio_num_t)antenna_en_gpio);
    }

    antenna_gpio = gpio;
    antenna_en_gpio = en_gpio;
    antenna_state = (state != 0) ? 1 : 0;

    esp_err_t err = set_config_param_int("ant_gpio", antenna_gpio);
    if (err == ESP_OK) {
        err = set_config_param_int("ant_en", antenna_en_gpio);
    }
    if (err == ESP_OK) {
        err = set_config_param_int("ant_sel", antenna_state);
    }
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Antenna switch: failed to save settings: %s", esp_err_to_name(err));
        return err;
    }

    return antenna_switch_apply();
}

void app_main(void)
{
    initialize_nvs();
    load_log_level();  // Apply saved log level early

    /* Restore timezone from NVS */
    {
        char *tz = NULL;
        if (get_config_param_str("tz", &tz) == ESP_OK && tz[0] != '\0') {
            setenv("TZ", tz, 1);
            tzset();
            ESP_LOGI(TAG, "Timezone set to: %s", tz);
        }
        free(tz);
    }

    /* OTA rollback support: confirm the running firmware is valid */
    const esp_partition_t *running = esp_ota_get_running_partition();
    esp_ota_img_states_t ota_state;
    if (esp_ota_get_state_partition(running, &ota_state) == ESP_OK) {
        if (ota_state == ESP_OTA_IMG_PENDING_VERIFY) {
            ESP_LOGI(TAG, "OTA: confirming new firmware on partition '%s'", running->label);
            esp_ota_mark_app_valid_cancel_rollback();
        }
    }

#if CONFIG_STORE_HISTORY
    initialize_filesystem();
    ESP_LOGI(TAG, "Command history enabled");
#else
    ESP_LOGI(TAG, "Command history disabled");
#endif

    get_config_param_blob("mac", &mac, 6);
    get_config_param_str("ssid", &ssid);
    if (ssid == NULL) {
        ssid = param_set_default("");
    }
    get_config_param_str("ent_username", &ent_username);
    if (ent_username == NULL) {
        ent_username = param_set_default("");
    }
    get_config_param_str("ent_identity", &ent_identity);
    if (ent_identity == NULL) {
        ent_identity = param_set_default("");
    }
    get_config_param_str("passwd", &passwd);
    if (passwd == NULL) {
        passwd = param_set_default("");
    }
    get_config_param_str("static_ip", &static_ip);
    if (static_ip == NULL) {
        static_ip = param_set_default("");
    }
    get_config_param_str("subnet_mask", &subnet_mask);
    if (subnet_mask == NULL) {
        subnet_mask = param_set_default("");
    }
    get_config_param_str("gateway_addr", &gateway_addr);
    if (gateway_addr == NULL) {
        gateway_addr = param_set_default("");
    }
    get_config_param_blob("ap_mac", &ap_mac, 6);
    get_config_param_str("ap_ssid", &ap_ssid);
    if (ap_ssid == NULL) {
        ap_ssid = param_set_default("ESP32_WiFi_Repeater");
    }
    get_config_param_str("ap_passwd", &ap_passwd);
    if (ap_passwd == NULL) {
        ap_passwd = param_set_default("");
    }
    get_config_param_str("ap_ip", &ap_ip);
    if (ap_ip == NULL) {
        ap_ip = param_set_default(DEFAULT_AP_IP);
    }
    get_config_param_str("ap_dns", &ap_dns);
    if (ap_dns == NULL) {
        ap_dns = param_set_default("");
    }
    get_config_param_str("hostname", &hostname);
    if (hostname == NULL || hostname[0] == '\0') {            
        free(hostname);                                       
        hostname = param_set_default(DEFAULT_HOSTNAME);
    }

    get_dhcp_reservations();
    load_acl_rules();

    // Load LED GPIO setting from NVS (default -1 = disabled)
    int led_gpio_setting = -1;
    if (get_config_param_int("led_gpio", &led_gpio_setting) == ESP_OK) {
        led_gpio = led_gpio_setting;
    }
    // led_gpio remains -1 (disabled) if not set in NVS

    // Load LED low-active setting from NVS (default 0 = active-high)
    int led_lowactive_setting = 0;
    if (get_config_param_int("led_low", &led_lowactive_setting) == ESP_OK) {
        led_lowactive = (led_lowactive_setting != 0) ? 1 : 0;
    }
    if (led_lowactive) {
        ESP_LOGI(TAG, "LED low-active mode enabled");
    }

    // Load addressable LED strip GPIO from NVS (default -1 = disabled)
    int led_strip_gpio_setting = -1;
    if (get_config_param_int("ls_gpio", &led_strip_gpio_setting) == ESP_OK) {
        led_strip_gpio = led_strip_gpio_setting;
    }

    // Antenna (RF) switch: select pin, optional enable pin and the selected
    // antenna. Disabled (GPIO -1) unless configured, so untouched boards keep
    // every pin free.
    int ant_gpio_setting = -1;
    if (get_config_param_int("ant_gpio", &ant_gpio_setting) == ESP_OK) {
        antenna_gpio = ant_gpio_setting;

        int ant_en_setting = -1;
        get_config_param_int("ant_en", &ant_en_setting);
        antenna_en_gpio = ant_en_setting;

        int ant_sel_setting = 0;
        get_config_param_int("ant_sel", &ant_sel_setting);
        antenna_state = (ant_sel_setting != 0) ? 1 : 0;
    }
#if defined(CONFIG_IDF_TARGET_ESP32C6)
    else {
        // Legacy XIAO ESP32-C6 key: GPIO3 enables the switch, GPIO14 selects
        int rf_switch_setting = 0;
        if (get_config_param_int("rf_switch", &rf_switch_setting) == ESP_OK && rf_switch_setting) {
            antenna_gpio = 14;
            antenna_en_gpio = 3;
            antenna_state = 1;
        }
    }
#endif
    antenna_switch_apply();

    // Load per-client stats enabled flag from NVS (default 0 = disabled)
    int cstats_setting = 0;
    if (get_config_param_int("cstats_en", &cstats_setting) == ESP_OK) {
        client_stats_enabled = (cstats_setting != 0);
    }
    if (client_stats_enabled) {
        ESP_LOGI(TAG, "Per-client stats enabled");
    }

    // Load TTL override setting from NVS (default 0 = disabled)
    int ttl_setting = 0;
    if (get_config_param_int("sta_ttl", &ttl_setting) == ESP_OK) {
        if (ttl_setting >= 0 && ttl_setting <= 255) {
            sta_ttl_override = (uint8_t)ttl_setting;
        }
    }
    if (sta_ttl_override > 0) {
        ESP_LOGI(TAG, "TTL override enabled: %d", sta_ttl_override);
    }

    // Load reconnect watchdog timeout from NVS (default 0 = disabled)
    int wd_setting = 0;
    if (get_config_param_int("wd_s", &wd_setting) == ESP_OK && wd_setting >= 0 && wd_setting <= 65535) {
        reconnect_watchdog_s = (uint16_t)wd_setting;
    }
    ESP_LOGI(TAG, "Reconnect watchdog: %s",
             reconnect_watchdog_s ? "enabled" : "disabled");
    if (reconnect_watchdog_s) {
        ESP_LOGI(TAG, "Watchdog timeout: %d s", reconnect_watchdog_s);
    }

    // Load AP disabled setting from NVS (default 0 = enabled)
    int ap_disabled_setting = 0;
    if (get_config_param_int("ap_disabled", &ap_disabled_setting) == ESP_OK) {
        ap_disabled = (ap_disabled_setting != 0);
    }
    if (ap_disabled) {
        ESP_LOGI(TAG, "AP interface disabled (NVS)");
    }

    // Load AP NAT setting from NVS (default 1 = NAT enabled)
    int ap_nat_setting = 1;
    if (get_config_param_int("ap_nat", &ap_nat_setting) == ESP_OK) {
        ap_nat_enabled = (ap_nat_setting != 0) ? 1 : 0;
    }
    if (!ap_nat_enabled) {
        ESP_LOGI(TAG, "AP NAT disabled (routed mode)");
    }

    // Load AP SSID hidden setting from NVS (default 0 = visible)
    int hidden_setting = 0;
    if (get_config_param_int("ap_hidden", &hidden_setting) == ESP_OK) {
        ap_ssid_hidden = (hidden_setting != 0) ? 1 : 0;
    }
    if (ap_ssid_hidden) {
        ESP_LOGI(TAG, "AP SSID hidden enabled");
    }

