martin-ger/esp32_nat_router/main/esp32_nat_router.c
    // Load AP auth mode from NVS (default 0 = WPA2/WPA3)
    int authmode_setting = 0;
    if (get_config_param_int("ap_authmode", &authmode_setting) == ESP_OK) {
        if (authmode_setting >= 0 && authmode_setting <= 2) {
            ap_authmode = (uint8_t)authmode_setting;
        }
    }
    if (ap_authmode > 0) {
        ESP_LOGI(TAG, "AP auth mode: %s", ap_authmode == 1 ? "WPA2" : "WPA3");
    }

    // Load WiFi country code from NVS (default "01" = world-safe)
    char *saved_cc = NULL;
    if (get_config_param_str("wifi_cc", &saved_cc) == ESP_OK && saved_cc != NULL) {
        if (strlen(saved_cc) == 2) {
            wifi_country_code[0] = saved_cc[0];
            wifi_country_code[1] = saved_cc[1];
            wifi_country_code[2] = '\0';
        }
        free(saved_cc);
    }
    ESP_LOGI(TAG, "WiFi country code: %s", wifi_country_code);

#if WIFI_HAS_5GHZ
    // Load STA band preference from NVS (default 0 = auto)
    int sta_band_setting = STA_BAND_AUTO;
    if (get_config_param_int("sta_band", &sta_band_setting) == ESP_OK) {
        if (sta_band_setting >= STA_BAND_AUTO && sta_band_setting <= STA_BAND_5G) {
            sta_band = (uint8_t)sta_band_setting;
        }
    }
    if (sta_band != STA_BAND_AUTO) {
        ESP_LOGI(TAG, "STA band preference: %s", sta_band == STA_BAND_2G ? "2.4 GHz" : "5 GHz");
    }
#endif

    // Load WPA2-Enterprise settings from NVS (defaults: 0)
    int eap_setting = 0;
    if (get_config_param_int("eap_method", &eap_setting) == ESP_OK) {
        eap_method = (int32_t)eap_setting;
    }
    int phase2_setting = 0;
    if (get_config_param_int("ttls_phase2", &phase2_setting) == ESP_OK) {
        ttls_phase2 = (int32_t)phase2_setting;
    }
    int cert_bundle_setting = 0;
    if (get_config_param_int("cert_bundle", &cert_bundle_setting) == ESP_OK) {
        use_cert_bundle = (int32_t)cert_bundle_setting;
    }
    int time_check_setting = 0;
    if (get_config_param_int("no_time_chk", &time_check_setting) == ESP_OK) {
        disable_time_check = (int32_t)time_check_setting;
    }

    /* Create one-shot timer for STA reconnect backoff */
    const esp_timer_create_args_t reconnect_timer_args = {
        .callback = sta_reconnect_timer_cb,
        .name = "sta_reconnect",
    };
    ESP_ERROR_CHECK(esp_timer_create(&reconnect_timer_args, &sta_reconnect_timer));

    wifi_init(mac, ssid, ent_username, ent_identity, passwd, static_ip, subnet_mask, gateway_addr, ap_mac, ap_ssid, ap_passwd, ap_ip);

    // Start IDF mDNS responder so the device is reachable as <hostname>.local
    // on both STA and AP interfaces. Active for all build variants.
    if (mdns_init() == ESP_OK) {
        mdns_hostname_set(hostname);
        mdns_service_add(NULL, "_http", "_tcp", 80, NULL, 0);
        ESP_LOGI(TAG, "mDNS started: %s.local", hostname);
    } else {
        ESP_LOGW(TAG, "mDNS init failed");
    }

    // Initialise addressable LED strip (if configured)
    led_strip_status_init();

    // Apply TX power setting from NVS (must be after esp_wifi_start)
    int tx_power_dbm = 0;
    if (get_config_param_int("tx_power", &tx_power_dbm) == ESP_OK && tx_power_dbm >= 2 && tx_power_dbm <= 20) {
        int8_t power_qdbm = (int8_t)(tx_power_dbm * 4);
        esp_err_t ret = esp_wifi_set_max_tx_power(power_qdbm);
        if (ret == ESP_OK) {
            int8_t actual = 0;
            esp_wifi_get_max_tx_power(&actual);
            ESP_LOGI(TAG, "TX power set to %.1f dBm", actual * 0.25);
        } else {
            ESP_LOGW(TAG, "Failed to set TX power: %s", esp_err_to_name(ret));
        }
    }

    // Apply WiFi country code (must be after esp_wifi_init, works after esp_wifi_start too)
    {
        esp_err_t ret = esp_wifi_set_country_code(wifi_country_code, true);
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "WiFi country code applied: %s", wifi_country_code);
        } else {
            ESP_LOGW(TAG, "Failed to apply WiFi country code %s: %s", wifi_country_code, esp_err_to_name(ret));
        }
    }

    pthread_t t1;
    pthread_create(&t1, NULL, led_status_thread, NULL);

#if !CONFIG_REPEATER_MODE
    if (!ap_disabled) {
        if (ap_nat_enabled) {
            ip_napt_enable(my_ap_ip, 1);
            ESP_LOGI(TAG, "NAT is enabled");
        } else {
            ESP_LOGI(TAG, "NAT is disabled (routed mode)");
        }
    }
#else
    ESP_LOGI(TAG, "Repeater mode: L2 bridge (no NAPT)");
    repeater_forward_init();
#endif


    char* web_disabled = NULL;
    get_config_param_str("web_disabled", &web_disabled);
    if (web_disabled == NULL) {
        web_disabled = param_set_default("0");
    }
    if (strcmp(web_disabled, "0") ==0) {
        int web_port_setting = 80;
        get_config_param_int("web_port", &web_port_setting);
        ESP_LOGI(TAG,"Starting web server on port %d", web_port_setting);
        start_webserver((uint16_t)web_port_setting);
    }
    free(web_disabled);

    // Initialize PCAP capture (TCP server on port 19000)
    pcap_init();

    // Initialize remote console (TCP server on port 2323, disabled by default)
    remote_console_init();

    // Initialize syslog client (UDP forwarding, disabled by default)
    syslog_init();

    // Initialize OLED display (ESP32-S3 defaults to enabled on GPIO17/18)
    oled_display_init();

    initialize_console();

    /* Register commands */
    esp_console_register_help_command();
    register_system();
    register_router();
#if CONFIG_REPEATER_MODE
    register_repeater_cli();
#endif

#if CONFIG_MQTT_HOMEASSISTANT
    mqtt_ha_init();
#endif

    /* Prompt to be printed before each line.
     * This can be customized, made dynamic, etc.
     */
    const char* prompt = LOG_COLOR_I "esp32> " LOG_RESET_COLOR;

    printf("\n"
           "ESP32 WiFi Repeater\n"
           "Type 'help' to get the list of commands.\n"
           "Use UP/DOWN arrows to navigate through command history.\n"
           "Press TAB when typing command name to auto-complete.\n");

    if (strlen(ssid) == 0) {
         printf("\n"
               "Unconfigured WiFi\n"
               "Configure using 'set_sta' and 'set_ap' and restart.\n");
    }

    /* Figure out if the terminal supports escape sequences */
    int probe_status = linenoiseProbe();
    if (probe_status) { /* zero indicates success */
        printf("\n"
               "Your terminal application does not support escape sequences.\n"
               "Line editing and history features are disabled.\n"
               "On Windows, try using Putty instead.\n");
        linenoiseSetDumbMode(1);
#if CONFIG_LOG_COLORS
        /* Since the terminal doesn't support escape sequences,
         * don't use color codes in the prompt.
         */
        prompt = "esp32> ";
#endif //CONFIG_LOG_COLORS
    }

    /* Main loop */
    while(true) {
        /* Get a line using linenoise.
         * The line is returned when ENTER is pressed.
         */
        char* line = linenoise(prompt);
        if (line == NULL) { /* Ignore empty lines */
            continue;
        }
        /* Add the command to the history */
        linenoiseHistoryAdd(line);
#if CONFIG_STORE_HISTORY
        /* Save command history to filesystem */
        linenoiseHistorySave(HISTORY_PATH);
#endif

        /* Try to run the command */
        int ret;
        esp_err_t err = esp_console_run(line, &ret);
        if (err == ESP_ERR_NOT_FOUND) {
            printf("Unrecognized command\n");
        } else if (err == ESP_ERR_INVALID_ARG) {
            // command was empty
        } else if (err == ESP_OK && ret != ESP_OK) {
            printf("Command returned non-zero error code: 0x%x (%s)\n", ret, esp_err_to_name(ret));
        } else if (err != ESP_OK) {
            printf("Internal error: %s\n", esp_err_to_name(err));
        }
        /* linenoise allocates line buffer on the heap, so need to free it */
        linenoiseFree(line);
    }
}
